importing pandas

In [3]:
import pandas as pd

SERIES

In [2]:
print('Series with numbers')
ser1=pd.Series([10,20,30,40,50])
print(ser1)

Series with numbers
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
print('Series with strings')
ser2=pd.Series(['python','AWS','java'])
print(ser2)

Series with strings
0    python
1       AWS
2      java
dtype: object

In [4]:
print("Slicing Series")
print(ser1[1:4])
print(ser1[::-1])
print(ser2.iloc[-1])
print(ser2.head())
print(ser2.tail())
print(ser2.head(2))
print(ser2.tail(2))

Slicing Series
1    20
2    30
3    40
dtype: int64
4    50
3    40
2    30
1    20
0    10
dtype: int64
java
0    python
1       AWS
2      java
dtype: object
0    python
1       AWS
2      java
dtype: object
0    python
1       AWS
dtype: object
1     AWS
2    java
dtype: object

DATAFRAME

In [5]:
print('DataFrames with numbers')
df1=pd.DataFrame({1,2,3,4,5})
print(df1)

DataFrames with numbers
   0
0  1
1  2
2  3
3  4
4  5

In [6]:
print('DataFrames with strings')
df2=pd.DataFrame({'id':['101','102','103','104','105'],'course':['java','AWS','python','cloud','html']})
print(df2)
print(df2['id'])
print(df2['id'][1:3])
print(df2['course'])
print(df2['course'][1:4])

DataFrames with strings
    id  course
0  101    java
1  102     AWS
2  103  python
3  104   cloud
4  105    html
0    101
1    102
2    103
3    104
4    105
Name: id, dtype: object
1    102
2    103
Name: id, dtype: object
0      java
1       AWS
2    python
3     cloud
4      html
Name: course, dtype: object
1       AWS
2    python
3     cloud
Name: course, dtype: object

In [7]:
print("Slicing Series")
print(df1[1:3])
print(df1[::-1])
print(df1.iloc[-3])
print(df2.head())
print(df2.tail())
print(df2.head(2))
print(df2.tail(2))

Slicing Series
   0
1  2
2  3
   0
4  5
3  4
2  3
1  2
0  1
0    3
Name: 2, dtype: int64
    id  course
0  101    java
1  102     AWS
2  103  python
3  104   cloud
4  105    html
    id  course
0  101    java
1  102     AWS
2  103  python
3  104   cloud
4  105    html
    id course
0  101   java
1  102    AWS
    id course
3  104  cloud
4  105   html

In [8]:
df3=pd.DataFrame({'sid':['101','102','103','104','105','106','107','108','109','110'],
      'sname':['ramu','ravi','kiran','raju','karthik','kumar',
               'balu','srinu','kishore','john']
      })
print(df3)
print(df3.iloc[1])
print(df3.iloc[0,0])
print(df3.iloc[5,1])

   sid    sname
0  101     ramu
1  102     ravi
2  103    kiran
3  104     raju
4  105  karthik
5  106    kumar
6  107     balu
7  108    srinu
8  109  kishore
9  110     john
sid       102
sname    ravi
Name: 1, dtype: object
101
kumar

In [9]:
df4=pd.DataFrame({
    'empno':[1001,1002,1003,1004,1005,1006,1007,1008],
    'ename':['ravi','ramu','raju','hari','giri','suri','raghu','kumar'],
    'job':['dev','tester','dev','devops','manager','dev','tester','dev']
})
print(df4)
print(df4.iloc[1,2])
print(df4.iloc[3,2])
print(df4.iloc[7,1])
print(df4.iloc[0:5])
print(df4.iloc[::-1])
print(df4.iloc[:,0])#complete record,1st column
print(df4.iloc[:,1])
print(df4.iloc[:,2])

   empno  ename      job
0   1001   ravi      dev
1   1002   ramu   tester
2   1003   raju      dev
3   1004   hari   devops
4   1005   giri  manager
5   1006   suri      dev
6   1007  raghu   tester
7   1008  kumar      dev
tester
devops
kumar
   empno ename      job
0   1001  ravi      dev
1   1002  ramu   tester
2   1003  raju      dev
3   1004  hari   devops
4   1005  giri  manager
   empno  ename      job
7   1008  kumar      dev
6   1007  raghu   tester
5   1006   suri      dev
4   1005   giri  manager
3   1004   hari   devops
2   1003   raju      dev
1   1002   ramu   tester
0   1001   ravi      dev
0    1001
1    1002
2    1003
3    1004
4    1005
5    1006
6    1007
7    1008
Name: empno, dtype: int64
0     ravi
1     ramu
2     raju
3     hari
4     giri
5     suri
6    raghu
7    kumar
Name: ename, dtype: object
0        dev
1     tester
2        dev
3     devops
4    manager
5        dev
6     tester
7        dev
Name: job, dtype: object

In [16]:
df5=pd.DataFrame({
    'empno':[1001,1002,1003,1004,1005,1006,1007,1008],
    'ename':['ravi','ramu','raju','hari','giri','suri','raghu','kumar'],
    'job':['dev','tester','dev','devops','manager','dev','tester','dev'],
    'sal':[2443,7922,3579,5793,7942,8327,5932,4792]
})
print(df5)
print(df5.iloc[[0,1,2],[1,3]])

   empno  ename      job   sal
0   1001   ravi      dev  2443
1   1002   ramu   tester  7922
2   1003   raju      dev  3579
3   1004   hari   devops  5793
4   1005   giri  manager  7942
5   1006   suri      dev  8327
6   1007  raghu   tester  5932
7   1008  kumar      dev  4792
  ename   sal
0  ravi  2443
1  ramu  7922
2  raju  3579

np.int64(2443)

In [18]:
df5.loc[1,'sal']

np.int64(7922)

In [20]:
df5.loc[3,['ename','sal']]

ename    hari
sal      5793
Name: 3, dtype: object

In [27]:
df5=pd.DataFrame({
    'empno':[1001,1002,1003,1004,1005,1006,1007,1008],
    'ename':['ravi','ramu','raju','hari','giri','suri','raghu','kumar'],
    'job':['dev','tester','dev','devops','manager','dev','tester','dev'], 
    'sal':[2443,7922,3579,5793,7942,8327,5932,4792],
    'deptno':[10,20,30,40,26,47,89,46]
})
df5

   empno  ename      job   sal  deptno
0   1001   ravi      dev  2443      10
1   1002   ramu   tester  7922      20
2   1003   raju      dev  3579      30
3   1004   hari   devops  5793      40
4   1005   giri  manager  7942      26
5   1006   suri      dev  8327      47
6   1007  raghu   tester  5932      89
7   1008  kumar      dev  4792      46

In [28]:
df5.iloc[::-1]

   empno  ename      job   sal  deptno
7   1008  kumar      dev  4792      46
6   1007  raghu   tester  5932      89
5   1006   suri      dev  8327      47
4   1005   giri  manager  7942      26
3   1004   hari   devops  5793      40
2   1003   raju      dev  3579      30
1   1002   ramu   tester  7922      20
0   1001   ravi      dev  2443      10

In [29]:
df5.iloc[2:9]

   empno  ename      job   sal  deptno
2   1003   raju      dev  3579      30
3   1004   hari   devops  5793      40
4   1005   giri  manager  7942      26
5   1006   suri      dev  8327      47
6   1007  raghu   tester  5932      89
7   1008  kumar      dev  4792      46

In [30]:
df5.loc[2,]

empno     1003
ename     raju
job        dev
sal       3579
deptno      30
Name: 2, dtype: object

In [39]:
df5.loc[[2],['empno','ename','job','sal','deptno']]

   empno ename  job   sal  deptno
2   1003  raju  dev  3579      30

In [40]:
df5

   empno  ename      job   sal  deptno
0   1001   ravi      dev  2443      10
1   1002   ramu   tester  7922      20
2   1003   raju      dev  3579      30
3   1004   hari   devops  5793      40
4   1005   giri  manager  7942      26
5   1006   suri      dev  8327      47
6   1007  raghu   tester  5932      89
7   1008  kumar      dev  4792      46

In [41]:
df5.index[-1]

7

In [42]:
df5.loc[[df5.index[-1]],'sal']

7    4792
Name: sal, dtype: int64

In [44]:
#get all employees who are developers
df5[df5['job']=='dev']

   empno  ename  job   sal  deptno
0   1001   ravi  dev  2443      10
2   1003   raju  dev  3579      30
5   1006   suri  dev  8327      47
7   1008  kumar  dev  4792      46

In [48]:
#get all employees whose salary more than 5000
df5[df5['sal']>=5000]

   empno  ename      job   sal  deptno
1   1002   ramu   tester  7922      20
3   1004   hari   devops  5793      40
4   1005   giri  manager  7942      26
5   1006   suri      dev  8327      47
6   1007  raghu   tester  5932      89

In [5]:
import pandas as pd 
df5=pd.DataFrame({
    'empno':[1001,1002,1003,1004,1005,1006,1007,1008],
    'ename':['ravi','ramu','raju','hari','giri','suri','raghu','kumar'],
    'job':['dev','tester','dev','devops','manager','dev','tester','dev'], 
    'sal':[2443,7922,3579,5793,7942,8327,5932,4792],
    'deptno':[10,20,30,40,26,47,89,46]
})
df5

   empno  ename      job   sal  deptno
0   1001   ravi      dev  2443      10
1   1002   ramu   tester  7922      20
2   1003   raju      dev  3579      30
3   1004   hari   devops  5793      40
4   1005   giri  manager  7942      26
5   1006   suri      dev  8327      47
6   1007  raghu   tester  5932      89
7   1008  kumar      dev  4792      46

In [7]:
#get all employee details based on name given
name_given=input("Enter employee name")
df5[df5['ename']==name_given]

Enter employee name hari

   empno ename     job   sal  deptno
3   1004  hari  devops  5793      40

In [30]:
df5[df5['job']=='dev']

   empno  ename  job   sal  deptno
0   1001   ravi  dev  2443      10
2   1003   raju  dev  3579      30
5   1006   suri  dev  8327      47
7   1008  kumar  dev  4792      46

In [35]:
#get all developers information whose sal is more than 5000
df5[(df5['job']=='dev') | (df5['job']=='tester')]

   empno  ename     job   sal  deptno
0   1001   ravi     dev  2443      10
1   1002   ramu  tester  7922      20
2   1003   raju     dev  3579      30
5   1006   suri     dev  8327      47
6   1007  raghu  tester  5932      89
7   1008  kumar     dev  4792      46

In [36]:
#aggregate functions
df5['sal']

0    2443
1    7922
2    3579
3    5793
4    7942
5    8327
6    5932
7    4792
Name: sal, dtype: int64

In [38]:
df5['sal'].max()

8327

In [39]:
df5['sal'].min()

2443

In [2]:
import pandas as pd 
df5=pd.DataFrame({
    'empno':[1001,1002,1003,1004,1005,1006,1007,1008],
    'ename':['ravi','ramu','raju','hari','giri','suri','raghu','kumar'],
    'job':['dev','tester','dev','devops','manager','dev','tester','dev'], 
    'sal':[2443,7922,3579,5793,7942,8327,5932,4792],
    'deptno':[10,20,30,40,26,47,89,46]
})

In [3]:
df5['sal'].std()

2161.315455920306

In [7]:
df5['sal'].mean()

np.float64(5841.25)

In [8]:
df5.describe()

            empno          sal    deptno
count     8.00000     8.000000   8.00000
mean   1004.50000  5841.250000  38.50000
std       2.44949  2161.315456  24.09505
min    1001.00000  2443.000000  10.00000
25%    1002.75000  4488.750000  24.50000
50%    1004.50000  5862.500000  35.00000
75%    1006.25000  7927.000000  46.25000
max    1008.00000  8327.000000  89.00000

In [9]:
df5['sal'].describe()

count       8.000000
mean     5841.250000
std      2161.315456
min      2443.000000
25%      4488.750000
50%      5862.500000
75%      7927.000000
max      8327.000000
Name: sal, dtype: float64

In [3]:
df5['sal'].cumsum()

0     2443
1    10365
2    13944
3    19737
4    27679
5    36006
6    41938
7    46730
Name: sal, dtype: int64

In [12]:
emptydata={
    'empno':[1001,1002,1003,1004,1005,1006,1007,1008,1009],
    'ename':['ravi','ramu','raju','hari','giri','suri','raghu','kumar','varma'],
    'job':['dev','tester','dev','devops','manager','dev','tester','dev','Dev'], 
    'sal':[2443,7922,3579,5793,7942,8327,5932,4792,3463],
    'deptno':[10,20,30,40,26,47,89,46,37]
}
emptydata
type(emptydata)

dict

In [13]:
import pandas as pd
df6=pd.DataFrame(emptydata)
df6

   empno  ename      job   sal  deptno
0   1001   ravi      dev  2443      10
1   1002   ramu   tester  7922      20
2   1003   raju      dev  3579      30
3   1004   hari   devops  5793      40
4   1005   giri  manager  7942      26
5   1006   suri      dev  8327      47
6   1007  raghu   tester  5932      89
7   1008  kumar      dev  4792      46
8   1009  varma      Dev  3463      37

In [20]:
df6[df6['job']=='dev']

   empno  ename  job   sal  deptno
0   1001   ravi  dev  2443      10
2   1003   raju  dev  3579      30
5   1006   suri  dev  8327      47
7   1008  kumar  dev  4792      46

In [21]:
df6[df6['job']=='Dev']

   empno  ename  job   sal  deptno
8   1009  varma  Dev  3463      37

In [15]:
df6[df6['job'].str.lower()=='dev']

   empno  ename  job   sal  deptno
0   1001   ravi  dev  2443      10
2   1003   raju  dev  3579      30
5   1006   suri  dev  8327      47
7   1008  kumar  dev  4792      46
8   1009  varma  Dev  3463      37

In [1]:
import pandas as pd

In [3]:
#reading data from csv file
eData=pd.read_csv('eData.csv')
eData

   empno   ename    job   sal  deptno
0   1001    raju    dev  1200    10.0
1    102    ravi   test  1000    20.0
2    103   kumar  saled  1500    30.0
3   1004  venkat  saled  1600    30.0
4   1005    suri   test  1200     NaN

In [6]:
#reading data from csv file with delimiter
eData2=pd.read_csv('eData2.csv',delimiter='#')
eData2

   empno   ename   job   sal  deptno
0   1001    raju   dev  1200    10.0
1    102    ravi  test  1000    20.0
2    103   kumar  sale  1500    30.0
3   1004  venkat  sale  1600    30.0
4   1005    suri  test  1200     NaN
5   1006    hari   dev  1100    30.0

In [10]:
eData.shape

(5, 5)

In [11]:
eData2.shape

(6, 5)

In [12]:
eData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   empno   5 non-null      int64
 1   ename   5 non-null      object
 2   job     5 non-null      object
 3   sal     5 non-null      int64
 4   deptno  4 non-null      float64
dtypes: float64(1), int64(2), object(2)
memory usage: 332.0+ bytes

In [13]:
eData2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   empno   6 non-null      int64
 1   ename   6 non-null      object
 2   job     6 non-null      object
 3   sal     6 non-null      int64
 4   deptno  5 non-null      float64
dtypes: float64(1), int64(2), object(2)
memory usage: 372.0+ bytes

In [14]:
eData.index

RangeIndex(start=0, stop=5, step=1)

In [17]:
eData2.index

RangeIndex(start=0, stop=6, step=1)

In [15]:
eData.dtypes

empno       int64
ename      object
job        object
sal         int64
deptno    float64
dtype: object

In [18]:
eData2.dtypes

empno       int64
ename      object
job        object
sal         int64
deptno    float64
dtype: object

In [16]:
eData.columns

Index(['empno', 'ename', 'job', 'sal', 'deptno'], dtype='object')

In [19]:
eData2.columns

Index(['empno', 'ename', 'job', 'sal', 'deptno'], dtype='object')

In [20]:
eData2

   empno   ename   job   sal  deptno
0   1001    raju   dev  1200    10.0
1    102    ravi  test  1000    20.0
2    103   kumar  sale  1500    30.0
3   1004  venkat  sale  1600    30.0
4   1005    suri  test  1200     NaN
5   1006    hari   dev  1100    30.0

iloc->Gives position

In [21]:
eData2.iloc[4]

empno     1005
ename     suri
job       test
sal       1200
deptno     NaN
Name: 4, dtype: object

In [27]:
eData2.iloc[1,3]

np.int64(1000)

In [24]:
eData2.iloc[4,2]

'test'

loc->Gives based on index

In [23]:
eData2.loc[4,'ename']

'suri'

In [25]:
eData2.at[0,'sal']

np.int64(1200)

In [26]:
eData2.at[5,'ename']

'hari'